
## Plan Result (terraform/mgmt/vpc)

[CI link](https://github.com/mileslee-nsuslab/tfaction-example/actions/runs/5998238517)


<pre><code>Plan: 18 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * module.vpc.aws_nat_gateway.this[0]
  * module.vpc.aws_nat_gateway.this[1]
  * module.vpc.aws_nat_gateway.this[2]
  * module.vpc.aws_route.private_nat_gateway[0]
  * module.vpc.aws_route.private_nat_gateway[1]
  * module.vpc.aws_route.private_nat_gateway[2]
  * module.vpc.aws_route_table_association.private[0]
  * module.vpc.aws_route_table_association.private[1]
  * module.vpc.aws_route_table_association.private[2]
  * module.vpc.aws_route_table_association.public[0]
  * module.vpc.aws_route_table_association.public[1]
  * module.vpc.aws_route_table_association.public[2]
  * module.vpc.aws_subnet.private[0]
  * module.vpc.aws_subnet.private[1]
  * module.vpc.aws_subnet.private[2]
  * module.vpc.aws_subnet.public[0]
  * module.vpc.aws_subnet.public[1]
  * module.vpc.aws_subnet.public[2]
* Update
  * module.vpc.aws_eip.nat[0]
  * module.vpc.aws_eip.nat[1]
  * module.vpc.aws_eip.nat[2]
  * module.vpc.aws_route_table.private[0]
  * module.vpc.aws_route_table.private[1]
  * module.vpc.aws_route_table.private[2]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-02ef315b3aada2768"
      ~ tags                 = {
            "Environment" = "dev"
          ~ "Name"        = "my-vpc-eu-west-1a" -> "my-vpc-us-east-1a"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "my-vpc-eu-west-1a" -> "my-vpc-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-04b662089c4e843e5"
      ~ tags                 = {
            "Environment" = "dev"
          ~ "Name"        = "my-vpc-eu-west-1b" -> "my-vpc-us-east-1b"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "my-vpc-eu-west-1b" -> "my-vpc-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0a7e968a652a8a0f9"
      ~ tags                 = {
            "Environment" = "dev"
          ~ "Name"        = "my-vpc-eu-west-1c" -> "my-vpc-us-east-1c"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "my-vpc-eu-west-1c" -> "my-vpc-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-02ef315b3aada2768"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-us-east-1a"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-04b662089c4e843e5"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-us-east-1b"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-us-east-1b"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0a7e968a652a8a0f9"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-us-east-1c"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-us-east-1c"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-089883fb520b48fff"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-02a1b17eff8906d23"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0da784595bce59dc6"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-089883fb520b48fff"
      ~ tags             = {
            "Environment" = "dev"
          ~ "Name"        = "my-vpc-private-eu-west-1a" -> "my-vpc-private-us-east-1a"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "my-vpc-private-eu-west-1a" -> "my-vpc-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-02a1b17eff8906d23"
      ~ tags             = {
            "Environment" = "dev"
          ~ "Name"        = "my-vpc-private-eu-west-1b" -> "my-vpc-private-us-east-1b"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "my-vpc-private-eu-west-1b" -> "my-vpc-private-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0da784595bce59dc6"
      ~ tags             = {
            "Environment" = "dev"
          ~ "Name"        = "my-vpc-private-eu-west-1c" -> "my-vpc-private-us-east-1c"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "my-vpc-private-eu-west-1c" -> "my-vpc-private-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-089883fb520b48fff"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-02a1b17eff8906d23"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-0da784595bce59dc6"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-033a16cc0803487f5"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-033a16cc0803487f5"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-033a16cc0803487f5"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-us-east-1b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-us-east-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-us-east-1c"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-us-east-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-us-east-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-us-east-1b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-us-east-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-us-east-1c"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-us-east-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

Plan: 18 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":33,"Program":"tfcmt","SHA1":"2716718c4552da4ff9166c7607ef64768cc21355","Target":"terraform/mgmt/vpc","Vars":{},"WorkflowName":"test"} -->